Repository: vadimbarda/portfolio_flutter
Catalog: l10n/intl_*.arb
Languages: uk

# buttonNext
source: Next
uk: Далі

# buttonShowWelcomeScreen
source: Show welcome screen
uk: Показати стартовий екран

# datePeriodMonths
source: {count, plural, zero{} one{{count} mo} other{{count} mos}}
uk: {count, plural, zero{} one{{count} міс.} other{{count} міс.}}

# datePeriodPresent
source: Present
uk: Теперішній час

# datePeriodYears
source: {count, plural, zero{} one{{count} yr} other{{count} yrs}}
uk: {count, plural, zero{} one{{count} р.} other{{count} р.}}

# mediaCasaConclusion
source: MediaCasa transforms the way users manage their photo and video collections, offering a comprehensive toolset for organizing media with ease and precision.
uk: MediaCasa трансформує спосіб, яким користувачі управляють своїми фото- та відеоколекціями, пропонуючи комплексний набір інструментів для легкої та точної організації медіа.

# mediaCasaDescription
source: MediaCasa is a desktop application designed to assist users in organizing their photos and videos by years and albums. It enables users to consolidate media from various devices like phones, DSLRs, and drones into one coherent timeline, simplifying media management.
uk: MediaCasa — це настільний додаток, створений для допомоги користувачам у організації їхніх фотографій та відео за роками та альбомами. Він дозволяє користувачам об'єднувати медіа з різних пристроїв, таких як телефони, DSLR-камери та дрони, у єдину послідовну шкалу, спрощуючи управління медіа.

# mediaCasaFeatureAlbumCreationDescription
source: The application automatically creates albums and groups within albums based on time and GPS locations, facilitating organized media storage.
uk: Додаток автоматично створює альбоми та групи в альбомах на основі часу та GPS-координат, сприяючи організованому зберіганню медіа.

# mediaCasaFeatureAlbumCreationName
source: Automatic Album and Group Creation
uk: Автоматичне створення альбомів та груп

# mediaCasaFeatureEditingCapabilityDescription
source: Enables editing of saved albums, allowing for ongoing management and organization of media collections.
uk: Дозволяє редагувати збережені альбоми, надаючи можливість постійного управління та організації медіаколекцій.

# mediaCasaFeatureEditingCapabilityName
source: Editable Albums
uk: Редагування альбомів

# mediaCasaFeatureNameSuggestionDescription
source: MediaCasa suggests album and group names by utilizing addresses derived from GPS locations, adding a layer of contextual organization.
uk: MediaCasa пропонує назви альбомів та груп, використовуючи адреси, отримані з GPS-координат, додаючи шар контекстної організації.

# mediaCasaFeatureNameSuggestionName
source: Suggested Album Names
uk: Пропозиції назв альбомів

# mediaCasaFeatureOrganizedStructureDescription
source: Saves media in an organized folder structure sorted by year and album, with descriptive file naming for easy retrieval.
uk: Зберігає медіа у організованій структурі каталогів, розподіленій за роками та назвами альбомів, з описовим іменуванням файлів для легкого пошуку.

# mediaCasaFeatureOrganizedStructureName
source: Organized Folder Structure
uk: Організована структура каталогів

# mediaCasaFeatureSimilarPhotosDescription
source: Features a Survey dialog mode to group similar photos, enabling users to compare and select the best ones easily.
uk: Містить режим діалогу Survey для групування схожих фотографій, дозволяючи користувачам легко порівнювати та вибирати найкращі.

# mediaCasaFeatureSimilarPhotosName
source: Grouping Similar Photos
uk: Групування схожих фотографій

# mediaCasaFeatureSourceSelectionDescription
source: Users can select source folders from multiple devices, bringing together all photos and videos in a unified timeline view.
uk: Користувачі можуть вибирати вхідні каталоги з кількох пристроїв, об'єднуючи всі фотографії та відео в єдиному перегляді часової шкали.

# mediaCasaFeatureSourceSelectionName
source: Source Folder Selection
uk: Вибір вхідних каталогів

# mediaCasaFeatureSubscriptionModelDescription
source: MediaCasa is offered through a subscription model, incorporating Stripe for secure and convenient payment processing.
uk: MediaCasa пропонується через модель підписки, інтегруючи Stripe для безпечної та зручної обробки платежів.

# mediaCasaFeatureSubscriptionModelName
source: Subscription Model with Stripe
uk: Модель підписки зі Stripe

# mediaCasaFeatureTimestampCorrectionDescription
source: Allows users to correct timestamps by shifting media to a specific period, ensuring chronological accuracy.
uk: Дозволяє користувачам коригувати часові мітки шляхом зміщення медіа на певний період, забезпечуючи хронологічну точність.

# mediaCasaFeatureTimestampCorrectionName
source: Timestamp Correction
uk: Корекція часових міток

# pivbankConclusion
source: Pivbank redefines the draught beer purchasing experience, offering an interactive, user-friendly platform that bridges the gap between traditional sales and digital innovation.
uk: Пивбанк переосмислює досвід покупки розливного пива, пропонуючи інтерактивну, зручну для користувача платформу, яка зводить нанівець розрив між традиційними продажами та цифровою інновацією.

# pivbankDescription
source: Pivbank is an innovative mobile application tailored for a family-owned draught beer business, enhancing the customer experience with real-time sales and engagement. Powered by a robust CMS built on PHP Laravel, the application seamlessly integrates with desktop applications across each shop, ensuring synchronized operations. Designed with the end-user in mind, Pivbank offers customers the convenience of registering via phone number and engaging in a comprehensive loyalty program.
uk: Пивбанк - це інноваційний мобільний додаток для сімейного бізнесу з продажу розливного пива, що покращує взаємодію з клієнтами завдяки продажам у реальному часі. Завдяки потужній CMS на базі PHP Laravel, додаток безперешкодно інтегрований з десктопними додатками у кожному магазині, забезпечуючи синхронізовану роботу. Пивбанк розроблений з орієнтацією на кінцевого користувача, пропонуючи зручність реєстрації через номер телефону та участь у всебічній програмі лояльності.

# pivbankFeatureAvailabilityDescription
source: Customers can browse the current beer selection available in each shop, allowing for informed purchasing decisions.
uk: Клієнти можуть переглядати актуальний асортимент пива, доступний у кожному магазині, що дозволяє робити обґрунтовані рішення про покупку.

# pivbankFeatureAvailabilityName
source: Real-Time Product Availability
uk: Наявність продуктів у реальному часі

# pivbankFeatureGamificationDescription
source: Incorporating gamification elements, customers are encouraged to complete simple tasks related to in-shop sales, enhancing interaction and enjoyment.
uk: Включення елементів гейміфікації заохочує клієнтів виконувати прості завдання, пов'язані з продажами в пивних магазинах, підвищуючи взаємодію та задоволення.

# pivbankFeatureGamificationName
source: Gamification
uk: Гейміфікація

# pivbankFeatureLevelsDescription
source: Each customer can track their progress within the app, with clear guidelines on how to reach the next level, fostering continued engagement.
uk: Кожен клієнт може стежити за своїм прогресом в додатку, з чіткими вказівками, як досягти наступного рівня, сприяючи продовженню залучення.

# pivbankFeatureLevelsName
source: Leveling System
uk: Система рівнів

# pivbankFeatureLoyaltyDescription
source: Engaging loyalty schemes coupled with attractive bonus programs reward customers for their patronage.
uk: Залучені схеми лояльності разом з привабливими бонусними програмами винагороджують клієнтів за їхню прихильність.

# pivbankFeatureLoyaltyName
source: Loyalty and Bonus Programs
uk: Програми лояльності та бонусів

# pivbankFeatureNotificationsDescription
source: Subscribers receive timely updates on the availability of their favorite beers, ensuring they never miss out.
uk: Підписники отримують своєчасні оновлення про наявність улюбленого пива, переконуючись, що вони нічого не пропустять.

# pivbankFeatureNotificationsName
source: Push Notifications
uk: Пуш-сповіщення

# pivbankFeatureOrderingDescription
source: The app facilitates easy ordering for both delivery and takeaway, streamlining the customer experience.
uk: Додаток спрощує процес замовлення як з доставкою, так і на винос, оптимізуючи взаємодію з клієнтами.

# pivbankFeatureOrderingName
source: Ordering and Takeaway
uk: Замовлення та винос

# pivbankFeatureTrackingDescription
source: The app provides real-time updates on order status, including the ability to track the delivery driver's location on a map, adding transparency and anticipation to the delivery process.
uk: Додаток надає оновлення про статус замовлення в реальному часі, включаючи можливість відстежувати місцезнаходження кур'єра на карті, додаючи прозорості та очікування до процесу доставки.

# pivbankFeatureTrackingName
source: Order Tracking
uk: Відстеження замовлення

# projectDescription
source: Description
uk: Опис

# projectNotPublished
source: This project is currently not available for public viewing due to business considerations.
uk: Цей проєкт наразі недоступний для публічного перегляду з комерційних міркувань.

# projectPlatforms
source: Platforms
uk: Платформи

# projectScreenshots
source: Screenshots
uk: Знімки екрану

# projectStorages
source: Download
uk: Завантаження

# settingsLanguage
source: Language
uk: Мова

# settingsThemeMode
source: Theme mode
uk: Кольорова тема

# tabAbout
source: About Me
uk: Про мене

# tabExperience
source: Experience
uk: Досвід

# tabProjects
source: Projects
uk: Проекти

# tabSettings
source: Settings
uk: Налаштування

# tglConclusion
source: While detailed functionalities of TGL's mobile application remain under wraps until its official release, its foundation on engaging content and innovative technology promises a new way to connect with golf.
uk: Хоча детальні функціональності мобільного додатку TGL залишаються нерозкритими до його офіційного випуску, його основа на залученому контенті та інноваційних технологіях обіцяє новий спосіб зв'язку з гольфом.

# tglDescription
source: TGL, abbreviated from Tomorrow Golf, represents a new era in golfing experiences. Sponsored by SoFi, TGL is a revolutionary professional golf league that merges cutting-edge technology with elite PGA TOUR athletes for a prime-time, two-hour weekly contest.
uk: TGL, що розшифровується як Tomorrow Golf, представляє нову еру в гольфі. Представлений SoFi, TGL є революційною професійною гольф-лігою, яка поєднує передові технології з елітними спортсменами PGA TOUR для щотижневих змагань у прайм-таймі тривалістю дві години.

# userHobbies
source: Hobbies
uk: Захоплення

# userHobbiesGuitar
source: Guitar
uk: Гітара

# userHobbiesSport
source: Sport
uk: Спорт

# userHobbiesVocal
source: Vocal
uk: Вокал

# userInterests
source: Interests
uk: Інтереси

# userInterestsAITools
source: AI tools
uk: Інструменти ШІ

# userInterestsInteriorDesign
source: Interior Design
uk: Дизайн інтер'єру

# userInterestsVideoEditing
source: Video editing
uk: Відеомонтаж

# userName
source: Vadym Barda
uk: Вадим Барда

# userProfile
source: Highly experienced and innovative Software Developer with over 10 years of experience in the industry, specializing in Flutter for mobile and desktop applications. Adept at leading development teams, designing and implementing modern web and mobile solutions, and delivering high-quality software products. Seeking to leverage my background in mobile development and my recent focus on Flutter to contribute as a Flutter Developer.
uk: Висококваліфікований та інноваційний розробник програмного забезпечення з понад 10 роками досвіду в галузі, спеціалізуюся на Flutter для мобільних та настільних додатків. Маю досвід у керівництві командами розробників, проєктуванні та впровадженні сучасних веб- та мобільних рішень, а також наданні програмних продуктів високої якості. Прагну використати свій досвід у мобільній розробці на Flutter.

# userSkills
source: Skills
uk: Навички

# userTitle
source: Flutter Software Developer
uk: Розробник на Flutter

# welcomeDescription
source: This portfolio mobile application is crafted by Vadym Barda using Flutter. Thank you for exploring it.
uk: Цей мобільний додаток було створено Вадимом Бардою на Flutter у якості портфоліо. Дякую за ваш інтерес.

# welcomeHeader
source: Welcome
uk: Вітаю

# workCollagePosition
source: Programming of Automated Systems
uk: Програмування для автоматизованих систем

# workCollege
source: Mykolaiv Polytechnic College
uk: Миколаївський Політехнічний Технікум

# workCollegeDescription
source: During my time at college, I graduated with distinction, earning a diploma as a Junior Specialist.
uk: Під час навчання в технікумі я отримав диплом молодшого спеціаліста з відзнакою.

# workInfrontDescription
source: Led the Front End team in developing a comprehensive web portal for PGATour, enhancing user engagement with interactive widgets and a mobile-responsive design.
uk: Керував командою Front End розробників при створенні комплексного веб-порталу для PGATour, покращуючи залученість користувачів за допомогою інтерактивних віджетів та мобільно-адаптивного дизайну.

# workLocationOnSite
source: On-site
uk: На місці

# workLocationRemote
source: Remote
uk: Віддалено

# workMediaCasaDescription
source: As the sole developer of a dynamic Flutter application, I've had the opportunity to bring to life a versatile media management tool currently in beta on both the Windows Store and Mac Store. This application streamlines the organization of personal photos and videos, enabling users to effortlessly categorize their memories by year and album. With advanced features like similarity detection, it assists users in identifying duplicate or near-identical images, making it simple to consolidate albums from multiple devices. My role encompassed the full development cycle, from conceptual design to deployment, ensuring a user-friendly experience across platforms.
uk: Як єдиний розробник динамічного додатку на Flutter, я мав можливість втілити у життя універсальний інструмент управління медіа, який наразі знаходиться в бета-версії в магазинах Windows Store та Mac Store. Цей додаток спрощує організацію особистих фотографій та відео, дозволяючи користувачам легко категоризувати свої спогади за роками та альбомами. Завдяки передовим функціям, таким як виявлення схожості, він допомагає користувачам виявляти дублікати або майже ідентичні зображення, спрощуючи об'єднання альбомів з кількох пристроїв. Моя роль охоплювала весь цикл розробки, від концептуального проєктування до впровадження, забезпечуючи зручне функціонування для користувача на різних платформах.

# workNextLeagueDescription
source: As a contractor, I have the pleasure of contributing to a dynamic team on the development of a cross-platform mobile application dedicated to golf innovations. Leveraging the power of Flutter, we've crafted an engaging experience for both iOS and Android users. My role involves integrating robust data layers through GraphQL requests and employing the BLoC architecture to ensure a reactive and maintainable codebase. Design fidelity is maintained by utilizing Figma as our source of truth for UI/UX design
uk: Як контрактор, вніс свій вклад в динамічну команду з розробки кросплатформеного мобільного додатку, присвяченого інноваціям у гольфі. Використовуючи можливості Flutter, ми створили захоплюючий досвід для користувачів iOS та Android. Моя роль полягала в інтеграції даних через запити GraphQL та використанні архітектури BLoC для забезпечення реактивності та легкої підтримки коду. Розробка дизайну підтримувалася за допомогою Figma.

# workOmnigonDescription
source: As a Senior Front-End Developer in the Sports and Entertainment sector, I led the creation of engaging single-page applications, live score widgets, and interactive portals, enhancing user experiences with real-time data and vibrant JavaScript graphics. My work involved seamless integrations with social networks and NoSQL databases, driving innovative second-screen experiences and fostering high user engagement across digital platforms. My expertise significantly contributed to elevating the digital presence and interactivity of sports and entertainment content.
uk: Як Senior Front-End розробник у сфері спорту та розваг, я очолював створення захоплюючих Single page додатків, віджетів з online-даними та інтерактивних порталів, покращуючи користувацький досвід за допомогою даних у реальному часі та яскравої графіки JavaScript. Моя робота включала інтеграцію з соціальними мережами та базами даних NoSQL, сприяючи інноваційному досвіду second screen та підвищуючи залученість користувачів на цифрових платформах. Мій досвід значно вніс вклад у підвищення цифрової присутності та інтерактивності контенту в сфері спорту та розваг.

# workPivbank
source: Pivbank
uk: Пивбанк

# workPivbankDescription
source: Developed a cross-platform customer application for a local family business in the draught beer sector, featuring loyalty programs, delivery ordering, and real-time tracking functionalities.
uk: Розробив кросплатформенний додаток для клієнтів місцевого сімейного бізнесу у сфері розливного пива, який включає програми лояльності, замовлення доставки та функціональність реального відстеження доставки.

# workPlaceKyiv
source: Kyiv, Ukraine
uk: Київ, Україна

# workPlaceMykolaiv
source: Mykolaiv, Ukraine
uk: Миколаїв, Україна

# workPlaceNewYork
source: New York, United States
uk: Нью-Йорк, Сполучені Штати

# workPlaceUSA
source: United States
uk: Сполучені Штати

# workPositionInteriorDesigner
source: Interior Designer & 3D Modeller
uk: Дизайнер інтер'єрів та 3D моделер

# workPositionLanAdministrator
source: LAN administrator
uk: Адміністратор мережі LAN

# workRichelieu
source: Richelieu
uk: Рішельє

# workRichelieuDescription
source: Utilizing 3ds Max, I participated in the design development and creation of models and drawings for a bar. The bar was constructed based on this project, showcasing the practical application of my design work and 3D modeling skills in bringing creative visions to life.
uk: Використовуючи 3ds Max, я брав участь у розробці дизайну та створенні моделей та креслень для бару. Бар був побудований на основі цього проекту, демонструючи практичне застосування моєї роботи з дизайном та 3D моделюванням у втіленні творчих ідей в життя.

# workTerrasoftDescription
source: Specialized in CRM configurations and development using JavaScript and .NET
uk: Спеціалізувався на налаштуванні та розробці CRM за допомогою JavaScript та .NET

# workTreasure
source: Mykolaiv City Treasure
uk: Миколаївське міське казначейство

# workTreasureDescription
source: Working as a network administrator at the City Treasury of Mykolaiv, I ensured the uninterrupted operation of information systems and network infrastructure, which is critically important for the effective management of city finances. My responsibilities included monitoring, configuring, and supporting network equipment, as well as ensuring the information security of data. Additionally, my thesis, conducted at the Treasury, allowed me to delve deeper into the specifics of the institution's work and make a significant contribution to the optimization of its IT processes.
uk: Працюючи адміністратором мережі у Міському казначействі Миколаєва, я забезпечував безперебійну роботу інформаційних систем та мережевої інфраструктури, що має вирішальне значення для ефективного управління міськими фінансами. Мої обов'язки включали моніторинг, налаштування та підтримку мережевого обладнання, а також забезпечення інформаційної безпеки даних. Крім того, моя дипломна робота, проведена на базі казначейства, дозволила глибше зануритися в специфіку роботи установи та внести значний вклад у оптимізацію її ІТ-процесів

# workTypeContract
source: Contract
uk: Контракт

# workTypeEducation
source: Education
uk: Освіта

# workTypeFreelance
source: Freelance
uk: Фріланс

# workTypeFullTime
source: Full-time
uk: Повний робочий день

# workTypePartTime
source: Part-time
uk: Неповний робочий день

# workUniverity
source: National University of Shipbuilding named after admiral Makarov
uk: Національний Університет Кораблебудування ім. адмірала Макарова

# workUniversityDescription
source: During my university studies, I was enrolled in the Department of Programming, where I pursued and obtained a Bachelor's degree, followed by a Specialist's degree. This educational journey provided me with a solid foundation in programming principles and practices, equipping me with the skills necessary to excel in the tech industry.
uk: Під час навчання в університеті я був зарахований на кафедру програмування, де я здобув ступінь бакалавра, а згодом - ступінь спеціаліста. Цей освітній шлях надав мені міцну основу в принципах та практиках програмування, наділивши мене необхідними навичками для досягнення успіху в галузі технологій.

# workUniversityPosition
source: Software Developing
uk: Програмне забезпечення
